app/views/users/show.html.erb


<%= User.find(@id).fname %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]