app/controllers/posts_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 30]]
---
	def index
		# @ is an instance variable, we do this to pass it to the controller
		@user = User.find(params[:user_id])

INSERT INTO "posts" ("created_at", "post_text", "post_title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-03 16:46:00.334267"], ["post_text", "SO many syntax errors!"], ["post_title", "Plural vs. Singular?"], ["updated_at", "2014-08-03 16:46:00.334267"]]
---
	def create
		@post = Post.new(params[:post])
		if @post.save