app/controllers/private_controller.rb

 def index
 	if session [:user_id].nil?
 		redirect_to 'login' if session [:user_id].nil?
 	end


 	@user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 29]]